cise-dispatcher/src/test/resources/soap-resptemplate.xml

<?xml version='1.0' encoding='UTF-8'?>
<!--
  ~ BSD 3-Clause License
  ~
  ~ Copyright (c) 2021, Joint Research Centre (JRC) All rights reserved.
  ~
  ~ Redistribution and use in source and binary forms, with or without
  ~ modification, are permitted provided that the following conditions are met:
  ~
  ~ 1. Redistributions of source code must retain the above copyright notice, this
  ~    list of conditions and the following disclaimer.
  ~
  ~ 2. Redistributions in binary form must reproduce the above copyright notice,
  ~    this list of conditions and the following disclaimer in the documentation
  ~    and/or other materials provided with the distribution.
  ~
  ~ 3. Neither the name of the copyright holder nor the names of its
  ~    contributors may be used to endorse or promote products derived from
  ~    this software without specific prior written permission.
  ~
  ~ THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  ~ AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  ~ IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  ~ DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  ~ FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  ~ DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  ~ SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  ~ CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  ~ OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  ~ OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  ~
  -->

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/eu.cise.dispatcher.soap/envelope/">
<S:Body>
    <ns5:send xmlns:ns2="http://www.cise.eu/servicemodel/v1/authority/"
              xmlns:ns3="http://www.cise.eu/servicemodel/v1/service/"
              xmlns:ns4="http://www.cise.eu/servicemodel/v1/message/"
              xmlns:ns5="http://www.cise.eu/accesspoint/service/v1/">
        <message xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns4:Push">
            <CorrelationID>{{request.headers.CorrelationID}}</CorrelationID>
            <CreationDateTime>{{request.headers.CreationDateTime}}</CreationDateTime>
            <MessageID>{{request.headers.MessageID}}</MessageID>
            <Priority>{{request.headers.Priority}}</Priority>
            <RequiresAck>{{request.headers.RequiresAck}}</RequiresAck>
            <Sender>
                <ServiceID>{{request.headers.Recipient.ServiceID}}</ServiceID>
                <ServiceOperation>{{request.headers.Recipient.ServiceOperation}}</ServiceOperation>
                <Participant/>
            </Sender>
            <Recipient>
                <ServiceID>{{request.headers.Sender.ServiceID}}</ServiceID>
                <ServiceOperation>{{request.headers.Sender.ServiceOperation}}</ServiceOperation>
                <ServiceType>{{request.headers.Sender.ServiceType}}</ServiceType>
                <Participant/>
            </Recipient>
            <Payload xsi:type="ns4:XmlEntityPayload">
                <InformationSensitivity>{{request.headers.InformationSensitivity}}</InformationSensitivity>
                <IsPersonalData>{{request.headers.IsPersonalData}}</IsPersonalData>
                <Purpose>{{request.headers.Purpose}}</Purpose>
                <EnsureEncryption>{{request.headers.EnsureEncryption}}</EnsureEncryption>
                <ns5:Vessel/>
            </Payload>
        </message>
    </ns5:send>
</S:Body>
</S:Envelope>